export default {
    // =============== 判断IP地址类型 ==============
    
    ip_address: "20.0.0.0",
    subnet_mask: "255.224.0.0",
    ip_address2: "", // <判断两ip是否属于同一个网络>路由专用
    subnet_mask2: "", // <判断两ip是否属于同一个网络>路由专用
    binOrdec: false,    // false为10进制, true为2进制
    throttle_timer: null,
    
    
    // ======================== 路由4(子网划分)  开始 ========================
    active: 0,  // 子网划分的步骤条
    subnet_type: "2",  // 子网划分的问题类型, 总共有4种
    // ======================== 路由4(子网划分)  结束 ========================

    // =============== 判断IP地址类型 ==============
}
